Repository: D3dMak51m/oqyul
Catalog: lib/l10n/intl_*.arb
Languages: uz

source: Cancel
uz: Bekor qilish

source: Error
uz: Xato

source: Loading...
uz: Yuklanmoqda...

# loginTitle
source: Login
uz: Kirish

# loginButton
source: Login
uz: Kirish

source: Forgot password?
uz: Parolni unutdingizmi?

source: Phone Number
uz: Telefon raqami

source: Password
uz: Parol

# registrationTitle
source: Registration
uz: Ro'yxatdan o'tish

# registerButton
source: Register
uz: Ro'yxatdan o'tish

source: Full Name
uz: To'liq ismi

source: Car Number
uz: Avtomobil raqami

source: Confirm Password
uz: Parolni tasdiqlang

# otpTitle
source: OTP Verification
uz: OTP Tasdiqlash

# otpInstruction
source: Enter the code sent to the number {phoneNumber}
uz: {phoneNumber} raqamiga yuborilgan kodni kiriting

# verifyButton
source: Verify
uz: Tasdiqlash

source: Resend Code
uz: Kod qayta yuborish

# invalidOtp
source: Invalid code. Please try again.
uz: Noto'g'ri kod. Qayta urinib ko'ring.

source: Code resent.
uz: Kod qayta yuborildi.

# homeTitle
source: Home
uz: Asosiy

source: Update Database
uz: Ma'lumotlar bazasini yangilash

# databaseUpdated
source: Database updated successfully
uz: Ma'lumotlar bazasi muvaffaqiyatli yangilandi

# premiumExpired
source: Premium mode expired
uz: Premium rejimi tugadi

# settingsTitle
source: Settings
uz: Sozlamalar

source: Dark Mode
uz: Qorong'i rejim

# language
source: Interface Language
uz: Interfeys tili

source: Notification Language
uz: Bildirishnoma tili

# locationPermissionDenied
source: No permission for location access
uz: Joylashuvga ruxsat berilmagan

source: Error loading map
uz: Xarita yuklashda xatolik

source: Error loading user data
uz: Foydalanuvchi ma'lumotlarini yuklashda xatolik

source: Error loading settings
uz: Sozlamalarni yuklashda xatolik

source: My Location
uz: Mening joylashuvim

source: Enable Driving Mode
uz: Haydash rejimini yoqish

source: Disable Driving Mode
uz: Haydash rejimini o'chirish

source: Enable Sound
uz: Ovozini yoqish

source: Disable Sound
uz: Ovozini o'chirish

# premiumModalTitle
source: Premium Mode
uz: Premium rejim

# premiumModalContent
source: Get access to updated data and additional features by activating premium mode.
uz: Premium rejimni faollashtirib, yangilangan ma'lumotlarga va qo'shimcha funksiyalarga ega bo'ling.

source: Watch Ad
uz: Reklamani ko'rish

# premiumExpiresIn
source: Premium expires in {time}
uz: Premium {time} dan keyin tugaydi

source: Invalid phone number
uz: Noto'g'ri telefon raqami

# invalidPassword
source: Password must be at least 6 characters
uz: Parol kamida 6 ta belgidan iborat bo'lishi kerak

# invalidFullName
source: Enter your full name
uz: To'liq ismingizni kiriting

# invalidCarNumber
source: Enter your car number
uz: Avtomobil raqamingizni kiriting

source: Passwords do not match
uz: Parollar mos kelmaydi
